def h():
    i:str
    print('Пиши текст ')
    i=list(input())
    l:float
    l=len(i)
    k={}
    j:str
    j=(input('Назови единицу исчисления '))
    k['килобайт']=0
    k['Килобайт']=0
    k['КИЛОБАЙТ']=0
    k['гигабайт']=0
    k['Гигабайт']=0
    k['ГИГАБАЙТ']=0
    k['мегабайт']=0
    k['МЕГАБАЙТ']=0
    k['Мегабайт']=0
    k['терабайт']=0
    k['ТЕРАБАЙТ']=0
    k['Терабайт']=0
    k['КБ']=0
    k['ГБ']=0
    k['МБ']=0
    k['ТБ']=0
    k['БИТ']=0
    k['гб']=0
    k['кб']=0
    k['мб']=0
    k['тб']=0
    k['Тбайт']=0
    k['Гбайт']=0
    k['Мбайт']=0
    k['Кбайт']=0
    k['бит']=0
    k['Бит']=0
    k['байт']=0
    k['Байт']=0
    k['БАЙТ']=0

    k[j] = 2
    li=l*8
    lp=li/1024
    lo=lp/1024
    lЙ=lo/1024
    lu=lЙ/1024
    lm=lu/1024
    
def a():
    print(li,'бит')
        

def b():
    print(l,'байт')


def c():
    print(lp,'килобайт')
    
    
def d():
    print(lo,'мегабайт')

     
def e():
    print(li,'гигабайт')
      
    
def f():
    print(lm,'терабайт')

def ikiki():
    
    h()

    if k['килобайт']==2:
        c()
    
    if k['Килобайт']==2:
        c()

    if k['КИЛОБАЙТ']==2:
        c()

    if k['гигабайт']==2:
        e()

    if k['ГИГАБАЙТ']==2:
        e()
    
    if k['Гигабайт']==2:
        e()    

    if k['БАЙТ']==2:
        b()

    if k['байт']==2:
        b()

    if k['Байт']==2:
        b()
    
    if k['мегабайт']==2:
        d()

    if k['МЕГАБАЙТ']==2:
        d()
        
    if k['Мегабайт']==2:
        d()

    if k['терабайт']==2:
        f()

    if k['ТЕРАБАЙТ']==2:
        f()

    if k['Терабайт']==2:
        f()

    if k['кб']==2:
        c()

    if k['КБ']==2:
        c()

    if k['Кбайт']==2:
        c()

    if k['гб']==2:
        e()

    if k['ГБ']==2:
        e()

    if k['Гбайт']==2:
        e()

    if k['мб']==2:
        d()

    if k['МБ']==2:
        d()

    if k['Мбайт']==2:
        d()
    
    if k['тб']==2:
        f()

    if k['ТБ']==2:
        f()

    if k['Тбайт']==2:
        f()

    if k['бит']==2:
        a()

    if k['БИТ']==2:
        a()

    if k['Бит']==2:
        a()


ikiki
